cassettes/shipments/refund_shipment.json

[{"duration":1140,"recorded_at":"2024-02-19T11:52:53.232566","request":{"body":"{\"shipment\":{\"carrier_accounts\":[\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"],\"customs_info\":{},\"from_address\":{\"city\":\"San Francisco\",\"country\":\"US\",\"email\":\"<REDACTED>\",\"name\":\"Jack Sparrow\",\"phone\":\"<REDACTED>\",\"state\":\"CA\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"zip\":\"94107\"},\"options\":{},\"parcel\":{\"height\":4.0,\"length\":10.0,\"width\":8.0,\"weight\":15.4},\"to_address\":{\"city\":\"Redondo Beach\",\"country\":\"US\",\"email\":\"<REDACTED>\",\"name\":\"Elizabeth Swan\",\"phone\":\"<REDACTED>\",\"state\":\"CA\",\"street1\":\"179 N Harbor Dr\",\"zip\":\"90277\"},\"carrier\":\"USPS\",\"service\":\"First\"}}","headers":{"Accept":"application/json","Content-Type":"application/json; charset=utf-8","Authorization":"<REDACTED>"},"method":"POST","uri":"https://api.easypost.com/v2/shipments?"},"response":{"body":"{\"created_at\":\"2024-02-19T18:52:52Z\",\"is_return\":false,\"messages\":[],\"mode\":\"test\",\"options\":{\"currency\":\"USD\",\"payment\":{\"type\":\"SENDER\"},\"date_advance\":0},\"reference\":null,\"status\":\"unknown\",\"tracking_code\":\"9400100110322018223175\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"batch_id\":null,\"batch_status\":null,\"batch_message\":null,\"customs_info\":null,\"from_address\":{\"id\":\"adr_158a43f3cf5811ee9c84ac1f6bc539aa\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"Jack Sparrow\",\"company\":null,\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"insurance\":null,\"order_id\":null,\"parcel\":{\"id\":\"prcl_b2dfad8d3a9f413993630a3372dde21f\",\"object\":\"Parcel\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"length\":10.0,\"width\":8.0,\"height\":4.0,\"predefined_package\":null,\"weight\":15.4,\"mode\":\"test\"},\"postage_label\":{\"object\":\"PostageLabel\",\"id\":\"pl_3c7d67d9b4294c26bf4550997b45d42e\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"date_advance\":0,\"integrated_form\":\"none\",\"label_date\":\"2024-02-19T18:52:52Z\",\"label_resolution\":300,\"label_size\":\"4x6\",\"label_type\":\"default\",\"label_file_type\":\"image/png\",\"label_url\":\"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20240219/e8ed3a842dbce84940a1edb34beebdecde.png\",\"label_pdf_url\":null,\"label_zpl_url\":null,\"label_epl2_url\":null,\"label_file\":null},\"rates\":[{\"id\":\"rate_43b490b9207c46de9ab564a1017b1bb8\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"Priority\",\"carrier\":\"USPS\",\"rate\":\"6.88\",\"currency\":\"USD\",\"retail_rate\":\"9.80\",\"retail_currency\":\"USD\",\"list_rate\":\"8.25\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_f5e061916864486cb140dff6ce3f2ee5\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"GroundAdvantage\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_2d9a70779b864c9d825aa459351f82de\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_756e727ca71c4db0b3b19f39606c3d9f\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"ParcelSelect\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_c28ec7fd923b432bb34f07b8b5dfc106\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"Express\",\"carrier\":\"USPS\",\"rate\":\"33.10\",\"currency\":\"USD\",\"retail_rate\":\"37.90\",\"retail_currency\":\"USD\",\"list_rate\":\"33.10\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":null,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":null,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"}],\"refund_status\":null,\"scan_form\":null,\"selected_rate\":{\"id\":\"rate_2d9a70779b864c9d825aa459351f82de\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},\"tracker\":{\"id\":\"trk_1d72376309044950b26810cc5de26046\",\"object\":\"Tracker\",\"mode\":\"test\",\"tracking_code\":\"9400100110322018223175\",\"status\":\"unknown\",\"status_detail\":\"unknown\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"signed_by\":null,\"weight\":null,\"est_delivery_date\":null,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier\":\"USPS\",\"tracking_details\":[],\"fees\":[],\"carrier_detail\":null,\"public_url\":\"https://track.easypost.com/djE6dHJrXzFkNzIzNzYzMDkwNDQ5NTBiMjY4MTBjYzVkZTI2MDQ2\"},\"to_address\":{\"id\":\"adr_1587d520cf5811eea2303cecef1b359e\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"ELIZABETH SWAN\",\"company\":null,\"street1\":\"179 N HARBOR DR\",\"street2\":\"\",\"city\":\"REDONDO BEACH\",\"state\":\"CA\",\"zip\":\"90277-2506\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":false,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":33.8436,\"longitude\":-118.39177,\"time_zone\":\"America/Los_Angeles\"}}}},\"usps_zone\":4,\"return_address\":{\"id\":\"adr_158a43f3cf5811ee9c84ac1f6bc539aa\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"Jack Sparrow\",\"company\":null,\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"buyer_address\":{\"id\":\"adr_1587d520cf5811eea2303cecef1b359e\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"ELIZABETH SWAN\",\"company\":null,\"street1\":\"179 N HARBOR DR\",\"street2\":\"\",\"city\":\"REDONDO BEACH\",\"state\":\"CA\",\"zip\":\"90277-2506\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":false,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":33.8436,\"longitude\":-118.39177,\"time_zone\":\"America/Los_Angeles\"}}}},\"forms\":[],\"fees\":[{\"object\":\"Fee\",\"type\":\"LabelFee\",\"amount\":\"0.01000\",\"charged\":true,\"refunded\":false},{\"object\":\"Fee\",\"type\":\"PostageFee\",\"amount\":\"5.93000\",\"charged\":true,\"refunded\":false}],\"id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"object\":\"Shipment\"}","headers":{"x-backend":"easypost","x-proxied":"intlb4nuq fe48f578d3,extlb2nuq d0e7ddf946","x-version-label":"easypost-202402162033-f6453b70c0-master","cache-control":"private, no-cache, no-store","transfer-encoding":"chunked","content-encoding":"gzip","strict-transport-security":"max-age=31536000; includeSubDomains; preload","x-ep-request-uuid":"beefdc3665d3a383f4403df300073c99","referrer-policy":"strict-origin-when-cross-origin","x-permitted-cross-domain-policies":"none","pragma":"no-cache","content-type":"application/json; charset=utf-8","x-xss-protection":"1; mode=block","location":"/api/v2/shipments/shp_cded137c085d42a19a81acc73950fd1b","x-download-options":"noopen","x-runtime":"1.006548","x-frame-options":"SAMEORIGIN","x-content-type-options":"nosniff","x-node":"bigweb31nuq","expires":"0","X-Via-DartVCR-Recording":"true"},"status":{"code":201,"message":"Created"}}},{"duration":370,"recorded_at":"2024-02-19T11:52:53.606303","request":{"body":"","headers":{"Accept":"application/json","Content-Type":"application/json","Authorization":"<REDACTED>"},"method":"GET","uri":"https://api.easypost.com/v2/shipments/shp_cded137c085d42a19a81acc73950fd1b/refund?"},"response":{"body":"{\"created_at\":\"2024-02-19T18:52:52Z\",\"is_return\":false,\"messages\":[],\"mode\":\"test\",\"options\":{\"currency\":\"USD\",\"payment\":{\"type\":\"SENDER\"},\"date_advance\":0},\"reference\":null,\"status\":\"unknown\",\"tracking_code\":\"9400100110322018223175\",\"updated_at\":\"2024-02-19T18:52:53Z\",\"batch_id\":null,\"batch_status\":null,\"batch_message\":null,\"customs_info\":null,\"from_address\":{\"id\":\"adr_158a43f3cf5811ee9c84ac1f6bc539aa\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"Jack Sparrow\",\"company\":null,\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"insurance\":null,\"order_id\":null,\"parcel\":{\"id\":\"prcl_b2dfad8d3a9f413993630a3372dde21f\",\"object\":\"Parcel\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"length\":10.0,\"width\":8.0,\"height\":4.0,\"predefined_package\":null,\"weight\":15.4,\"mode\":\"test\"},\"postage_label\":{\"object\":\"PostageLabel\",\"id\":\"pl_3c7d67d9b4294c26bf4550997b45d42e\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"date_advance\":0,\"integrated_form\":\"none\",\"label_date\":\"2024-02-19T18:52:52Z\",\"label_resolution\":300,\"label_size\":\"4x6\",\"label_type\":\"default\",\"label_file_type\":\"image/png\",\"label_url\":\"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20240219/e8ed3a842dbce84940a1edb34beebdecde.png\",\"label_pdf_url\":null,\"label_zpl_url\":null,\"label_epl2_url\":null,\"label_file\":null},\"rates\":[{\"id\":\"rate_43b490b9207c46de9ab564a1017b1bb8\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"Priority\",\"carrier\":\"USPS\",\"rate\":\"6.88\",\"currency\":\"USD\",\"retail_rate\":\"9.80\",\"retail_currency\":\"USD\",\"list_rate\":\"8.25\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_f5e061916864486cb140dff6ce3f2ee5\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"GroundAdvantage\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_2d9a70779b864c9d825aa459351f82de\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_756e727ca71c4db0b3b19f39606c3d9f\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"ParcelSelect\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_c28ec7fd923b432bb34f07b8b5dfc106\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"Express\",\"carrier\":\"USPS\",\"rate\":\"33.10\",\"currency\":\"USD\",\"retail_rate\":\"37.90\",\"retail_currency\":\"USD\",\"list_rate\":\"33.10\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":null,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":null,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"}],\"refund_status\":\"submitted\",\"scan_form\":null,\"selected_rate\":{\"id\":\"rate_2d9a70779b864c9d825aa459351f82de\",\"object\":\"Rate\",\"created_at\":\"2024-02-19T18:52:52Z\",\"updated_at\":\"2024-02-19T18:52:52Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.93\",\"currency\":\"USD\",\"retail_rate\":\"8.45\",\"retail_currency\":\"USD\",\"list_rate\":\"6.40\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},\"tracker\":{\"id\":\"trk_1d72376309044950b26810cc5de26046\",\"object\":\"Tracker\",\"mode\":\"test\",\"tracking_code\":\"9400100110322018223175\",\"status\":\"pre_transit\",\"status_detail\":\"status_update\",\"created_at\":\"2024-02-19T18:52:53Z\",\"updated_at\":\"2024-02-19T18:52:53Z\",\"signed_by\":null,\"weight\":null,\"est_delivery_date\":\"2024-02-19T18:52:53Z\",\"shipment_id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"carrier\":\"USPS\",\"tracking_details\":[{\"object\":\"TrackingDetail\",\"message\":\"Pre-Shipment Info Sent to USPS\",\"description\":\"\",\"status\":\"pre_transit\",\"status_detail\":\"status_update\",\"datetime\":\"2024-01-19T18:52:53Z\",\"source\":\"USPS\",\"carrier_code\":\"\",\"tracking_location\":{\"object\":\"TrackingLocation\",\"city\":null,\"state\":null,\"country\":null,\"zip\":null}},{\"object\":\"TrackingDetail\",\"message\":\"Shipping Label Created\",\"description\":\"\",\"status\":\"pre_transit\",\"status_detail\":\"status_update\",\"datetime\":\"2024-01-20T07:29:53Z\",\"source\":\"USPS\",\"carrier_code\":\"\",\"tracking_location\":{\"object\":\"TrackingLocation\",\"city\":\"HOUSTON\",\"state\":\"TX\",\"country\":null,\"zip\":\"77063\"}}],\"fees\":[],\"carrier_detail\":{\"object\":\"CarrierDetail\",\"service\":\"First-Class Package Service\",\"container_type\":null,\"est_delivery_date_local\":null,\"est_delivery_time_local\":null,\"origin_location\":\"HOUSTON TX, 77001\",\"origin_tracking_location\":{\"object\":\"TrackingLocation\",\"city\":\"HOUSTON\",\"state\":\"TX\",\"country\":null,\"zip\":\"77063\"},\"destination_location\":\"CHARLESTON SC, 29401\",\"destination_tracking_location\":null,\"guaranteed_delivery_date\":null,\"alternate_identifier\":null,\"initial_delivery_attempt\":null},\"public_url\":\"https://track.easypost.com/djE6dHJrXzFkNzIzNzYzMDkwNDQ5NTBiMjY4MTBjYzVkZTI2MDQ2\"},\"to_address\":{\"id\":\"adr_1587d520cf5811eea2303cecef1b359e\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"ELIZABETH SWAN\",\"company\":null,\"street1\":\"179 N HARBOR DR\",\"street2\":null,\"city\":\"REDONDO BEACH\",\"state\":\"CA\",\"zip\":\"90277-2506\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":false,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":33.8436,\"longitude\":-118.39177,\"time_zone\":\"America/Los_Angeles\"}}}},\"usps_zone\":4,\"return_address\":{\"id\":\"adr_158a43f3cf5811ee9c84ac1f6bc539aa\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"Jack Sparrow\",\"company\":null,\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"buyer_address\":{\"id\":\"adr_1587d520cf5811eea2303cecef1b359e\",\"object\":\"Address\",\"created_at\":\"2024-02-19T18:52:52+00:00\",\"updated_at\":\"2024-02-19T18:52:52+00:00\",\"name\":\"ELIZABETH SWAN\",\"company\":null,\"street1\":\"179 N HARBOR DR\",\"street2\":null,\"city\":\"REDONDO BEACH\",\"state\":\"CA\",\"zip\":\"90277-2506\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":false,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":33.8436,\"longitude\":-118.39177,\"time_zone\":\"America/Los_Angeles\"}}}},\"forms\":[],\"fees\":[{\"object\":\"Fee\",\"type\":\"LabelFee\",\"amount\":\"0.01000\",\"charged\":true,\"refunded\":false},{\"object\":\"Fee\",\"type\":\"PostageFee\",\"amount\":\"5.93000\",\"charged\":true,\"refunded\":false}],\"id\":\"shp_cded137c085d42a19a81acc73950fd1b\",\"object\":\"Shipment\"}","headers":{"x-backend":"easypost","x-proxied":"intlb3nuq fe48f578d3,extlb2nuq d0e7ddf946","x-version-label":"easypost-202402162033-f6453b70c0-master","cache-control":"private, no-cache, no-store","transfer-encoding":"chunked","content-encoding":"gzip","strict-transport-security":"max-age=31536000; includeSubDomains; preload","x-ep-request-uuid":"beefdc3665d3a385f4403df300073d76","referrer-policy":"strict-origin-when-cross-origin","x-permitted-cross-domain-policies":"none","pragma":"no-cache","content-type":"application/json; charset=utf-8","x-xss-protection":"1; mode=block","x-download-options":"noopen","x-runtime":"0.330374","x-frame-options":"SAMEORIGIN","x-canary":"direct","x-content-type-options":"nosniff","x-node":"bigweb53nuq","expires":"0","X-Via-DartVCR-Recording":"true"},"status":{"code":200,"message":"OK"}}}]